import React from 'react';
import { DISCORD } from 'src/constants/dex';
import WindowOpen from 'src/utils/windowOpen';

const ukr = {
  authorization_mode_tips: (
    <>
      <b>Без підпису</b>
      <br />
      Авторизуйтесь один раз та розміщуйте ордери без підпису
      <br />
      <br />
      <b>Завжди підписувати</b>
      <br />
      Підписуйте у своєму гаманці кожну транзакцію при розміщенні ордеру
    </>
  ),
  service_unavailable_for_blacklist: (
    <>
      <div>
        Ваш доступ до DeGate обмежено. Для отримання додаткової інформації
        відвідайте{' '}
        <a
          href="https://discord.com/channels/814731180892487702/1086188643342889020"
          target="_black"
        >
          DeGate спільнота
        </a>{' '}
        .
      </div>
    </>
  ),
  initialization_desc: (
    <>
      Ви отримаєте два запити на підпис. <br />
      Підпис безкоштовний.
    </>
  ),
  'account.deposit_status_help': (
    <>
      <b>Pending</b> <br />
      Очікування обробки транзакції в блоці.
      <br />
      <br />
      <b>Підтвердження</b>
      <br />
      Транзакція оброблена в блоці. Очікування підтверджень.
      <br />
      <br />
      <b>Успішно</b>
      <br />
      Кошти зараховані та доступні для торгівлі
    </>
  ),
  'account.transfer_status_help': (
    <>
      <b>Success</b> <br />
      Ваш актив зараховано. Очікуємо остаточного підтвердження в блокчейні
      Ethereum.
      <br />
      <br />
      <b>Finalized</b> <br />
      Блок з транзакцією остаточно підтверджено в блокчейні Ethereum.
    </>
  ),
  'account.withdraw_status_help': (
    <>
      <b>Processing</b> <br />
      Обробляємо запит на відправлення
      <br />
      <br />
      <b>Success</b> <br />
      Актив надісланий на адресу отримувача &apos;s address.
      <br />
      <br />
      <b>Завершено</b>
      <br /> Блок з транзакцією остаточно підтверджено в блокчейні Ethereum.
    </>
  ),
  'account.personal_sign_tips': (
    <>
      <div>
        MetaMask просить вас підписати ще раз методом <i>Персональний підпис</i>{' '}
        method
      </div>
    </>
  ),
  tips_dex_balance: (
    <>
      Баланс DeGate представляє собою загальну вартість активів, які користувачі
      зберігають у смарт-контракті DeGate.
      <br />
      <br />
      Додавши кошти в Баланс DeGate, ви можете миттєво розміщувати і скасовувати
      ордера. Ви також можете відправити ці кошти на будь-яку адресу Ethereum.
    </>
  ),
  'account.init_step1_title': (
    <>
      Як користувач вперше, потрібна ініціалізація. Цей процес займе приблизно{' '}
      <b>30 секунд</b>.
    </>
  ),
  'trade.max_number_of_trades_tips': (
    <>
      Ордер може бути виконаний кількома угодами; наприклад, ордер на $100 може
      бути виконане угодами по $30 і $70.
      <br />
      {`"Максимальна кількість угод" обмежує кількість разів, коли ордер може бути`}
      виконаний при торгівлі як Тейкер.
    </>
  ),
  'trade.flow_of_funds_tips': (
    <>
      <h3>Рух коштів</h3>Кошти потраплять на ваш Баланс DeGate, а не на баланс
      гаманця.
      <br />
      <br />
      <h3> Про DeGate баланс</h3>Баланс DeGate представляє собою вартість
      активів, які користувачі зберігають у смарт-контракті DeGate.
      <br />
      <br />
      Користувачі повністю контролюють Баланс DeGate завдяки повністю
      децентралізованому смарт-контракту DeGate.
    </>
  ),
  'gridOrders.detail_transactions_unit': (
    <>
      <span></span>
    </>
  ),
  'gridOrders.grid_cancel_tips_text': <>Нагороди доступні через</>,
  'gridOrders.grid_cancel_tips_content': `Нагороди за майнінг будуть актуалізовагівідразу як сіткова Grid стратегія відпрацює 12 годин.`,
  'mining.pools_mining_funds_tips': (
    <>
      Загальна вартість сіткових ордерів в межах діапазону майнінгу.
      <br />
      <br />
      Діапазон цін для майнінгу: від найвищої ціни покупки в книзі замовлень *
      0.99 до найнижчої ціни продажу в книзі замовлень * 1.01
    </>
  ),
  'mining.pools_mining_funds_tips_stable': (
    <>
      Загальна вартість сіткових ордерів в межах діапазону майнінгу.
      <br />
      <br />
      Діапазон цін для майнінгу: від найвищої ціни покупки в ордер-буці до
      найнижчої ціни продажу в ордер-буці.
    </>
  ),
  'campaign.grid2401_desc': (
    <>
      Сіткова Grid стратегія є потужним інструментом, який може використовувати
      ринкові коливання в межах заданого діапазону цін.Сіткова стратегія
      встановлює кілька ордерів на купівлю і продаж, щоб автоматично купувати
      дешево і продавати дорого для отримання прибутку. Якщо ви хочете
      дізнатися, як створити індивідуальну сіткову Grid стратегію, будь ласка,
      зверніться до{' '}
      <a
        href="https://docs.degate.com/v/product_en/product-tutorial/grid-strategy-creation-guide"
        target="_blank"
      >
        https://docs.degate.com/v/product_en/product-tutorial/grid-strategy-creation-guide
      </a>
    </>
  ),
  'campaign.notes_2_desc': (
    <>
      Максимальна вартість сіткової Grid стратегії на одного користувача, яка
      підлягає розрахунку частки призового фонду, обмежена $<b>5000</b>.
    </>
  ),
  'campaign.grid2401_faq_1_res': (
    <>
      Загальний призовий фонд складає 21,000 USDC, з яких 3,000 USDC
      розподіляються кожні 24 години, всього 7 розподілів.
      <br /> <br />
      <br /> <br />
      Після початку події система буде проводити розрахунки кожні 24 години і
      розподілить щоденний призовий фонд серед відповідних сіткових стратегій
      відповідно до їх ваги. Вага розраховується на основі вартості стратегії і
      тривалості в хвилинах створеної сітки в той день.
      <br /> <br />
      Вартість сіткової стратегії визначається початковою вартістю при
      налаштуванні сітки і не змінюється з коливаннями ціни. Кожен користувач
      має ліміт участі в фонді для підвищення сіткової стратегії в $5000.
      Користувачі можуть налаштувати кілька відповідних стратегій з однієї
      адреси протягом активності, але загальна сума відповідних коштів обмежена
      $5000.
      <br /> <br />
      Наприклад: є тільки два користувача, які беруть участь у події сіткових
      стратегій. На момент розрахунку через 24 години, Користувач А налаштував
      сітку вартістю $2,500 тривалістю 500 хвилин, а Користувач Б налаштував
      сітку вартістю $6,000 тривалістю 1,000 хвилин. Якщо 3,000 USDC
      розподіляються в цей день, то вага співвідношення A до B буде:```jsx
      (2,500 x 500) / (5,000 x 1,000) = 1:4, що означає, що A отримає 600 USDC,
      а B отримає 2,400 USDC.
    </>
  ),
  'campaign.grid2401_faq_2_res': (
    <>
      Приєднуйтесь до нас{' '}
      <a href={DISCORD} target="_blank">
        Discord
      </a>{' '}
      і зверніться за допомогою в спеціальній темі, створеній для цього заходу.
    </>
  ),
  'account.deposit_contract_tips_AMOUNT': (AMOUNT: string) => (
    <div>
      <b>Стандартний</b>
      <div>
        Через простий переказ токенів на смарт-контракт DeGate кошти додаються з
        мінімальними витратами на газ. Цей метод має обмеження на транзакцію в{' '}
        {AMOUNT}USD.
      </div>
      <br />
      <b>Продвинутий</b>
      <div>
        Цей метод використовує внутрішню функцію смарт-контракту DeGate, що
        призводить до вищих витрат на газ. Однак він не має максимального
        ліміту.
      </div>
    </div>
  ),
  trading_fee_tips: (v: string) => (
    <>
      Maker：0.00%
      <br />
      Taker：{v || '0.05%'}
    </>
  ),
  'notification.cancel_market_for_depth_desc': (showDesc: any) => {
    return (
      <>
        Будь-який ринковий ордер, шо перевищує{' '}
        <b onClick={showDesc}>захист ціни від просковжування10%)</b> буде
        автоматично скасований
      </>
    );
  },
  'dca.max_gas_per_order': (Ele: any) => <>{Ele} за ордер</>,
  'campaign.grid2401_step1_desc': (
    baseAmount: string,
    quoteAmount: string,
    baseSymbol: string,
    quoteSymbol: string
  ) => {
    return (
      <>
        Мінімальна рекомендована інвестиція{' '}
        <b>
          {baseAmount} {baseSymbol}
        </b>{' '}
        and{' '}
        <b>
          {quoteAmount} {quoteSymbol}
        </b>
      </>
    );
  },
  'campaign.grid2401_step2_desc1': (minPrice: string, maxPrice: string) => (
    <>
      Діапазон цін: {minPrice} до {maxPrice}
    </>
  ),
  'campaign.grid2401_step2_desc2': (num: string) => <>Кількість сіток: {num}</>,
  'campaign.grid2401_faq_3_res': (feesUrl: string, Pair1: any, Pair2: any) => (
    <>
      Користувачі можуть отримати ETH через пару {Pair1} в DeGate, а USDC через
      пару {Pair2}. DeGate пропонує надзвичайно низькі торгові комісії. Для
      деталей, будь ласка, зверніться до розділу &apos;
      <a
        href={feesUrl}
        onClick={(e) => {
          e.stopPropagation();
          e.preventDefault();
          WindowOpen(feesUrl);
        }}
      >
        Комісії
      </a>
      &apos; section.
    </>
  ),
  device_fast: (time: number) => (
    <>
      Ваш пристрій <br />
      <b>{time} секунд швидше</b>
    </>
  ),
  device_slow: (time: number) => (
    <>
      Ваш пристрій <br />
      <b>{time} секунд повільніше</b>
    </>
  ),
  localTime_tips: (
    <>
      Встановіть &apos;s налаштування часу на &quot;Автоматично&quot;, щоб
      протокол DeGate працював коректно.
      <br />
      <b>Будь ласка, оновіть сторінку для активації змін.</b>
    </>
  ),
};

export default ukr;
